Revit 2027 API
DefaultDivideSettings.SetSurfaceNumber Method
 Sets the default Divided Surface number for a fixed number layout for U or V gridlines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSurfaceNumber(
	UVGridlineType gridlines,
	int number
)
Public Sub SetSurfaceNumber (
	gridlines As UVGridlineType,
	number As Integer
)
public:
void SetSurfaceNumber(
	UVGridlineType gridlines,
	int number
)
member SetSurfaceNumber :
        gridlines : UVGridlineType *
        number : int -> unit
Parameters
gridlines UVGridlineType
 U-gridlines or V-gridlines.
number Int32
 A default number for a fixed number layout.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given value for number is not positive. -or- A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace